{
  "main": {
    "name": "Tyler Williams",
    "occupation": "full stack software engineer",
    "description": "proficient in Bootstrap, CSS3, Express, Node.js, PostgreSQL and React.js. One year of experience collaborating with software engineers of varying experience levels allowing myself to be introduced to multiple codebases of varying complexity. Firm believer in creating responsive, user-friendly websites utilizing the mobile-first approach. Soon to be Thinkful certified. Strong willingness to learn and grow through collaboration with an accepting, project-driven team",
    "image": "profilepic.jpg",
    "bio": "I am a 20 year old full stack software engineer, natural socialite and passionate musician. I have had an interest in engineering/creating something out of nothing from an early age thanks to my grandpa. He was an automotive engineer for Ford and so we bonded over math and creations made possible because of it. Originally, I thought I'd follow in his tracks and build parts for cars as an automotive engineer but ended up falling in love with software development at 17 ( my last year of highschool). This led me to pursue a degree in Applied Computer Science at NAU, whereafter two years I realized I was not learning adequately to succeed as a software engineer. So, I made one of the smartest--my family may some dumbest--decisions of my life and dropped out of college to find a better way to reach my goal. That's when I found Thinkful which gave me all the tools I needed to create software at a large scale and then some. I'm excited to leave my mark as an innovator in this industry as I learn and create more!  ",
    "email": "Tylerwilliams1737@gmail.com",
    "phone": "480-717-1737",
    "address": {
      "city": "Phoenix"
    },
    "website": "http://www.timbakerdev.com",
    "social": [
      {
        "name": "linkedin",
        "url": "http://www.linkedin.com/in/tyler-williams-career/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/SinceWhenBro",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I am a passionate Full Stack Developer and a socialite at heart. I have a personal passion for web development and app development and aspire to develop my own apps that solve large problems in a user-friendly way...",
    "education": [
      {
        "school": "Northern Arizona University (NAU)",
        "degree": "Applied Computer Science",
        "graduated": "2019-2021",
        "description": "Personally, I did not feel that I was learning the methods and tools needed to succeed in this industry at NAU. Following two years of taking classes that couldn't help but feel outdated or lacking applicability I decided to drop out of university and seek a better option...That being said I did learn MATLAB, Java, Eclipse and learn some of the foundations of Data Structures and algorithms."
      },
      {
        "school": "Thinkful",
        "degree": "Software Engineering Bootcamp",
        "graduated": "August-December 2021",
        "description": "Within 2 weeks of my attending a rigorous software engineering course I felt that I had more applicable knowledge to the software engineering space than I attained my entire time at NAU. Over the entirety of the course I became proficient in VSCode, HTML5, CSS3, JavaScript, React.js, Bootstrap, Node.js, Knex.js, PostgreSQL, Express, Data Structures, Algorithms, Postman, and Github."
      }
    ],
    "work": [
      {
        "company": "Northern Arizona University ITS",
        "title": "Assistant Programmer",
        "years": "February 2020 - February 2021",
        "description": "Although only an introductory position I worked to maintain live applications such as online lunch portals via updating packages frequently (utilizing Node.js), gained experience working with programmers of varying experience levels to reach a goal or solve a problem and was hired on with little to no experience using the languages or frameworks that were heavily employed at this position, but rose to the occasion and learned quickly to maintain my position."
      },
      {
        "company": "Johnston & Murphy's",
        "title": "Sales Associate",
        "years": "May 2018 – December 2019 ",
        "description": "Worked on a commission pay scale that required me to become an expert in sales. I am a natural socialite so I exceeded here as one of it's top sellers during my time as an associate. Around 6 months into the position I became entrusted with one of two store keys, the other belonging to the store manager. This was a position I thrived in as I love being social and talking to people and this gave me an avenue to be social, helpful, profitable and meet deadlines all at once. "
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "50%"
      },
      {
        "name": "Express",
        "level": "55%"
      },
      {
        "name": "React.js",
        "level": "70%"
      },
      {
        "name": "CSS",
        "level": "60%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "Node.js",
        "level": "50%"
      },
      {
        "name": "PostreSQL",
        "level": "55%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Decoder Ring",
        "category": "An app to both decode and encode messages depending on the given algorithm",
        "image": "decoder-ring.jpg",
        "url": "https://github.com/SinceWhenBro/qualified-challenges/tree/master/Decoder-Ring"
      },
      {
        "title": "Flashcard-o-matic",
        "category": "An app designed for students to study and teacher's to provide the material needed to study.",
        "image": "flashcard.jpg",
        "url": "https://github.com/SinceWhenBro/qualified-challenges/tree/master/Project_Flashcards_Qualified_1"
      },
      {
        "title": "Pomodoro Timer",
        "category": "Both decode and encode messages depending on the given algorithm",
        "image": "decoder-ring.jpg",
        "url": "https://github.com/SinceWhenBro/qualified-challenges/tree/master/Project_Pomodoro_Timer_Qualified"
      },
      {
        "title": "Restaurant Reservation",
        "category": "A full-stack app that stores reservations for restaurant goers (Still in production)",
        "image": "restaurant-reservation.jpg",
        "url": "https://github.com/SinceWhenBro/starter-reservation-system"
      },
      {
        "title": "WeLoveMovies",
        "category": "Developed the back-end for a movie review application",
        "image": "we-love-movies.jpg",
        "url": "https://github.com/SinceWhenBro/WeLoveMovie"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "One of the few people I have met that genuinely pours their heart into anything they try their hand at...",
        "user": "Jacob Beiley - Audio Engineer"
      },
      {
        "text": "I see a lot of me in you, if I would've had my head on my shoulders and been as focused on my career as you when I was your age I'd be even further along then I am now. Stick with software engineering and I'm sure I could see you leading a team or creating something popular and profitable.",
        "user": "Jose Cherry - Staff Lead Developer"
      }
    ]
  }
}
